Oryx-Embedded/CycloneTCP/drivers/mac/mpc5748_eth2_driver.c
/**
 * @file mpc5748_eth2_driver.c
 * @brief NXP MPC5748 Ethernet MAC driver (ENET1 instance)
 *
 * @section License
 *
 * SPDX-License-Identifier: GPL-2.0-or-later
 *
 * Copyright (C) 2010-2026 Oryx Embedded SARL. All rights reserved.
 *
 * This file is part of CycloneTCP Open.
 *
 * This program is free software; you can redistribute it and/or
 * modify it under the terms of the GNU General Public License
 * as published by the Free Software Foundation; either version 2
 * of the License, or (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program; if not, write to the Free Software Foundation,
 * Inc., 51 Franklin Street, Fifth Floor, Boston, MA  02110-1301, USA.
 *
 * @author Oryx Embedded SARL (www.oryx-embedded.com)
 * @version 2.6.2
 **/

//Switch to the appropriate trace level
#define TRACE_LEVEL NIC_TRACE_LEVEL

//Dependencies
#include "device_registers.h"
#include "interrupt_manager.h"
#include "core/net.h"
#include "drivers/mac/mpc5748_eth2_driver.h"
#include "debug.h"

//Underlying network interface
static NetInterface *nicDriverInterface;

//TX buffer
static uint8_t txBuffer[MPC5748_ETH2_TX_BUFFER_COUNT][MPC5748_ETH2_TX_BUFFER_SIZE]
   __attribute__((aligned(64)));
//RX buffer
static uint8_t rxBuffer[MPC5748_ETH2_RX_BUFFER_COUNT][MPC5748_ETH2_RX_BUFFER_SIZE]
   __attribute__((aligned(64)));
//TX buffer descriptors
static uint32_t txBufferDesc[MPC5748_ETH2_TX_BUFFER_COUNT][8]
   __attribute__((aligned(64)));
//RX buffer descriptors
static uint32_t rxBufferDesc[MPC5748_ETH2_RX_BUFFER_COUNT][8]
   __attribute__((aligned(64)));

//TX buffer index
static uint_t txBufferIndex;
//RX buffer index
static uint_t rxBufferIndex;


/**
 * @brief MPC5748 Ethernet MAC driver (ENET1 instance)
 **/

const NicDriver mpc5748Eth2Driver =
{
   NIC_TYPE_ETHERNET,
   ETH_MTU,
   mpc5748Eth2Init,
   mpc5748Eth2Tick,
   mpc5748Eth2EnableIrq,
   mpc5748Eth2DisableIrq,
   mpc5748Eth2EventHandler,
   mpc5748Eth2SendPacket,
   mpc5748Eth2UpdateMacAddrFilter,
   mpc5748Eth2UpdateMacConfig,
   mpc5748Eth2WritePhyReg,
   mpc5748Eth2ReadPhyReg,
   TRUE,
   TRUE,
   TRUE,
   FALSE
};


/**
 * @brief MPC5748 Ethernet MAC initialization
 * @param[in] interface Underlying network interface
 * @return Error code
 **/

error_t mpc5748Eth2Init(NetInterface *interface)
{
   error_t error;
   uint32_t value;

   //Debug message
   TRACE_INFO("Initializing MPC5748 Ethernet MAC (ENET1)...\r\n");

   //Save underlying network interface
   nicDriverInterface = interface;

   //GPIO configuration
   mpc5748Eth2InitGpio(interface);

   //Reset ENET module
   ENET_1->ECR = ENET_ECR_RESET_MASK;
   //Wait for the reset to complete
   while((ENET_1->ECR & ENET_ECR_RESET_MASK) != 0)
   {
   }

   //Configure MAC for MII mode
   ENET_1->RCR = ENET_RCR_MAX_FL(MPC5748_ETH2_RX_BUFFER_SIZE) |
      ENET_RCR_MII_MODE_MASK;

   //Transmit control register
   ENET_1->TCR = 0;
   //Configure MDC clock frequency
   ENET_1->MSCR = ENET_MSCR_MII_SPEED(19);

   //Valid Ethernet PHY or switch driver?
   if(interface->phyDriver != NULL)
   {
      //Ethernet PHY initialization
      error = interface->phyDriver->init(interface);
   }
   else if(interface->switchDriver != NULL)
   {
      //Ethernet switch initialization
      error = interface->switchDriver->init(interface);
   }
   else
   {
      //The interface is not properly configured
      error = ERROR_FAILURE;
   }

   //Any error to report?
   if(error)
   {
      return error;
   }

   //Set the MAC address of the station (upper 16 bits)
   value = interface->macAddr.b[5];
   value |= (interface->macAddr.b[4] << 8);
   ENET_1->PAUR = ENET_PAUR_PADDR2(value) | ENET_PAUR_TYPE(0x8808);

   //Set the MAC address of the station (lower 32 bits)
   value = interface->macAddr.b[3];
   value |= (interface->macAddr.b[2] << 8);
   value |= (interface->macAddr.b[1] << 16);
   value |= (interface->macAddr.b[0] << 24);
   ENET_1->PALR = ENET_PALR_PADDR1(value);

   //Hash table for unicast address filtering
   ENET_1->IALR = 0;
   ENET_1->IAUR = 0;
   //Hash table for multicast address filtering
   ENET_1->GALR = 0;
   ENET_1->GAUR = 0;

   //Disable transmit accelerator functions
   ENET_1->TACC = 0;
   //Disable receive accelerator functions
   ENET_1->RACC = 0;

   //Use enhanced buffer descriptors
   ENET_1->ECR = ENET_ECR_EN1588_MASK;

   //Reset statistics counters
   ENET_1->MIBC = ENET_MIBC_MIB_CLEAR_MASK;
   ENET_1->MIBC = 0;

   //Initialize buffer descriptors
   mpc5748Eth2InitBufferDesc(interface);

   //Clear any pending interrupts
   ENET_1->EIR = 0xFFFFFFFF;
   //Enable desired interrupts
   ENET_1->EIMR = ENET_EIMR_TXF_MASK | ENET_EIMR_RXF_MASK | ENET_EIMR_EBERR_MASK;

   //Configure ENET transmit interrupt priority
   INT_SYS_SetPriority(ENET1_GROUP2_IRQn, MPC5748_ETH2_IRQ_PRIORITY);
   //Configure ENET receive interrupt priority
   INT_SYS_SetPriority(ENET1_GROUP1_IRQn, MPC5748_ETH2_IRQ_PRIORITY);
   //Configure ENET error interrupt priority
   INT_SYS_SetPriority(ENET1_GROUP0_IRQn, MPC5748_ETH2_IRQ_PRIORITY);

   //Enable Ethernet MAC
   ENET_1->ECR |= ENET_ECR_ETHEREN_MASK;
   //Instruct the DMA to poll the receive descriptor list
   ENET_1->RDAR = ENET_RDAR_RDAR_MASK;

   //Accept any packets from the upper layer
   osSetEvent(&interface->nicTxEvent);

   //Successful initialization
   return NO_ERROR;
}


/**
 * @brief GPIO configuration
 * @param[in] interface Underlying network interface
 **/

__weak_func void mpc5748Eth2InitGpio(NetInterface *interface)
{
//MPC5748G-GW-RDB evaluation board?
#if defined(USE_MPC5748G_GW_RDB)
   //Configure MII_1_TX_CLK (PE12)
   SIUL2->MSCR[76] = SIUL2_MSCR_SMC_MASK | SIUL2_MSCR_IBE_MASK;
   SIUL2->IMCR[460] = SIUL2_IMCR_SSS(1);

   //Configure MII_1_TX_EN (PI12)
   SIUL2->MSCR[140] = SIUL2_MSCR_SRC(3) | SIUL2_MSCR_OBE_MASK |
      SIUL2_MSCR_SMC_MASK | SIUL2_MSCR_SSS(3);

   //Configure MII_1_TXD0 (PA11)
   SIUL2->MSCR[11] = SIUL2_MSCR_SRC(3) | SIUL2_MSCR_OBE_MASK |
      SIUL2_MSCR_SMC_MASK | SIUL2_MSCR_SSS(3);

   //Configure MII_1_TXD1 (PA10)
   SIUL2->MSCR[10] = SIUL2_MSCR_SRC(3) | SIUL2_MSCR_OBE_MASK |
      SIUL2_MSCR_SMC_MASK | SIUL2_MSCR_SSS(4);

   //Configure MII_1_TXD2 (PH3)
   SIUL2->MSCR[115] = SIUL2_MSCR_SRC(3) | SIUL2_MSCR_OBE_MASK |
      SIUL2_MSCR_SMC_MASK | SIUL2_MSCR_SSS(4);

   //Configure MII_1_TXD3 (PI13)
   SIUL2->MSCR[141] = SIUL2_MSCR_SRC(3) | SIUL2_MSCR_OBE_MASK |
      SIUL2_MSCR_SMC_MASK | SIUL2_MSCR_SSS(3);

   //Configure MII_1_RX_CLK (PB11)
   SIUL2->MSCR[27] = SIUL2_MSCR_SMC_MASK | SIUL2_MSCR_IBE_MASK;
   SIUL2->IMCR[459] = SIUL2_IMCR_SSS(2);

   //Configure MII_1_RX_DV (PB5)
   SIUL2->MSCR[21] = SIUL2_MSCR_SMC_MASK | SIUL2_MSCR_IBE_MASK;
   SIUL2->IMCR[465] = SIUL2_IMCR_SSS(2);

   //Configure MII_1_RXD0 (PD10)
   SIUL2->MSCR[58] = SIUL2_MSCR_SMC_MASK | SIUL2_MSCR_IBE_MASK;
   SIUL2->IMCR[461] = SIUL2_IMCR_SSS(2);

   //Configure MII_1_RXD1 (PD9)
   SIUL2->MSCR[57] = SIUL2_MSCR_SMC_MASK | SIUL2_MSCR_IBE_MASK;
   SIUL2->IMCR[462] = SIUL2_IMCR_SSS(2);

   //Configure MII_1_RXD2 (PB7)
   SIUL2->MSCR[23] = SIUL2_MSCR_SMC_MASK | SIUL2_MSCR_IBE_MASK;
   SIUL2->IMCR[463] = SIUL2_IMCR_SSS(2);

   //Configure MII_1_RXD3 (PB6)
   SIUL2->MSCR[22] = SIUL2_MSCR_SMC_MASK | SIUL2_MSCR_IBE_MASK;
   SIUL2->IMCR[464] = SIUL2_IMCR_SSS(2);

   //Configure PHY reset pin (PI11)
   SIUL2->MSCR[139] = SIUL2_MSCR_OBE_MASK | SIUL2_MSCR_SMC_MASK;

